tests/load/artillery/config.yml
config:
  target: "{{ $processEnvironment.WS_URL }}"
  phases:
    - duration: 60
      arrivalRate: 5
      name: "Warm up"
    - duration: 300
      arrivalRate: 20
      name: "Sustained load"
    - duration: 60
      arrivalRate: 50
      name: "Spike"
  ws:
    rejectUnauthorized: false
  processor: "./functions.js"
  beforeScenario: "setupParticipant"