tests/load/artillery/websocket-chat.yml
config:
  target: "{{ $processEnvironment.WS_URL }}"
  phases:
    - duration: 60
      arrivalRate: 10
    - duration: 300
      arrivalRate: 30
  ws:
    rejectUnauthorized: false
  processor: "./functions.js"
  beforeScenario: "setupParticipant"

scenarios:
  - name: "Chat participant"
    engine: ws
    flow:
      - connect: "/ws?token={{ token }}"
      - think: 2

      # Wait for connection confirmation
      - wait:
          json: { type: "connected" }

      # Send chat messages at intervals
      - loop:
          - send:
              json:
                type: "chat.send"
                payload:
                  content: "Hello from Artillery {{ $uuid }}"
          - think: 5
        count: 20

      # Send some reactions
      - loop:
          - send:
              json:
                type: "reaction.send"
                payload:
                  emoji: "👍"
          - think: 3
        count: 5